class Textholder{

  static String text(int textKey){
    String finalText = "";
    switch(textKey){
      case 0: finalText = """В последнее время все казалось серым? Вам грустно чаще, чем нет? Многие люди иногда чувствуют себя подавленными, но депрессия - это другое. Это длится долго и мешает наслаждаться жизнью.

    При депрессии даже небольшие задачи кажутся невыполнимыми. Вы теряете интерес к хобби и общению с друзьями. Все кажется унылым. Ваша энергия на исходе. Депрессия - это не просто чувство "подавленности" - это серьезное состояние, требующее лечения.

    Хорошая новость в том, что депрессия поддается лечению. Врач может помочь найти первопричину и лучшие методы лечения для вас. Терапия и медикаментозное лечение являются распространенными вариантами и работают для многих людей. Выбор здорового образа жизни также может улучшить ваше настроение.

    Важно помнить, что депрессия - это не признак слабости, это болезнь, такая же, как диабет или астма. И вы не одиноки - депрессией страдают миллионы людей из всех слоев общества. Обращение за помощью - это смелость, за которую не стоит стыдиться.

    Если вы боретесь с постоянной грустью или безнадежностью, поговорите со своим врачом. Не ждите, пока все станет по-настоящему плохо. Лечение - это первый шаг к улучшению самочувствия. У вас впереди еще столько замечательной жизни. Есть люди и ресурсы, которые помогут вам пройти через это. У вас это есть!
    """;
      case 1: finalText = """Вы работаете на пустом месте?

Кажется ли вам, что вы постоянно устаете, даже после хорошего ночного сна? Чувствуете ли вы себя более раздражительным и менее терпеливым, чем обычно? Возможно, вы испытываете эмоциональное выгорание.

Выгорание - это не просто стресс, это когда вашему телу и разуму больше нечего отдать. Это может случиться, когда вы слишком долго находились под постоянным давлением без перерыва. Забота о других, требования работы, финансовые заботы - все это со временем сказывается, если не управлять им должным образом.

Признаками эмоционального выгорания являются ощущение истощения энергии и энтузиазма. Вы теряете интерес к вещам, которые вам обычно нравятся. Даже небольшие задачи кажутся утомительными. Отношения могут пострадать, потому что у вас нет энергии для других.

Важно бороться с эмоциональным выгоранием до того, как оно усугубится. Сделайте отдых и подзарядку приоритетом. Уделяйте время занятиям только для себя, даже если поначалу вам трудно себя мотивировать. Поговорите с друзьями и врачом - они могут помочь вам уменьшить факторы стресса и разработать план ухода за собой.

Помните, вы не сверхчеловек! Невозможно продолжать безостановочно, без последствий. Будьте добры к себе и не пытайтесь добиться успеха с помощью выгорания в одиночку. Небольшие изменения могут иметь большое значение. Вы поняли - ваше благополучие того стоит!
""";
      case 3: finalText = """Что такое СДВГ?
СДВГ расшифровывается как синдром дефицита внимания и гиперактивности. Это очень распространенное заболевание, из-за которого может быть трудно сосредоточиться и контролировать поведение. Некоторым детям и взрослым с СДВГ трудно обращать внимание, сидеть неподвижно или контролировать импульсивное поведение. Они могут действовать, не думая о том, что может произойти.

Звучит знакомо? Если вам трудно сосредоточиться или контролировать себя, возможно, у вас СДВГ. Многие люди с СДВГ чувствуют беспокойство или гиперактивность. Их мысли могут часто блуждать. Им может быть трудно выполнять задания или следовать указаниям.

СДВГ - это не просто проблема с силой воли. Это заболевание, связанное с развитием нервной системы. Это означает, что мозг может развиваться не так, как другие. Части мозга, отвечающие за внимание и самоконтроль, работают не так хорошо. Но в СДВГ нет ничьей вины. Просто так устроен мозг некоторых людей.

Лекарства нет, но СДВГ хорошо поддается лечению. Коучинг, медицина, терапия и изменение образа жизни - все это может помочь справиться с симптомами. При правильной поддержке люди с СДВГ могут добиться успеха в школе и на работе. У них может быть счастливая, здоровая жизнь.

Самое главное - не падать духом. Если вы считаете, что у вас СДВГ, поговорите с родителями или врачом. Они могут помочь вам пройти обследование. Затем вы узнаете стратегии для вашей уникальной ситуации. После некоторых настроек вы сможете лучше сосредоточиться и лучше контролировать ситуацию. У вас все получится!
""";
      case 2: finalText = """Что происходит внутри? Понимание алекситимии

Вы когда-нибудь чувствовали, что ваши эмоции - загадка? Как будто вы не всегда знаете, почему вы чувствуете то или иное? Это то, с чем сталкиваются многие люди с алекситимией.

Алекситимия означает, что у вас возникают проблемы с идентификацией и описанием собственных эмоций. Дело не в том, что вы чувствуете себя слишком незначительно - дело в том, что вы смущены своими чувствами! Люди с алекситимией могут не осознавать, что они испытывают стресс или расстроены, пока не взорвутся. Их тело подает физические признаки эмоций, которым они не могут дать названия.

Это может усложнить отношения, потому что эмоциями нелегко делиться. Недопонимание может произойти, если вы не можете сказать, как у вас на самом деле обстоят дела внутри. Но в алекситимии нет ничьей вины - просто так устроен мозг некоторых людей, когда дело доходит до эмоций.

Хорошая новость в том, что есть вещи, которые вы можете сделать. Ведение журнала чувств может помочь вам научиться обозначать то, что происходит внутри. Разговор с консультантом или близким другом также может дать понимание. Не отчаивайтесь - с практикой вы сможете лучше понимать себя. У вас это получится!
""";
      case 4: finalText = """Постоянно чувствуешь себя плохо? Это может быть дистимия

Когда-нибудь испытывал чувство, что просто не можешь избавиться от болтовни? У тебя постоянно плохое настроение без подъемов? Возможно, у вас дистимия, также называемая стойким депрессивным расстройством.

При дистимии чувства печали, безнадежности и низкой энергии сохраняются большую часть дня, почти каждый день - более двух лет! Это похоже на легкую депрессию, которая просто тянется все дальше и дальше.

Простые задачи могут показаться утомительными. Вам может не хватать интереса к тому, что раньше доставляло вам удовольствие. Из-за дистимии вам трудно чувствовать мотивацию или удовлетворение. Но это отличается от обычной грусти, потому что она длится так долго, без перерывов между эпизодами.

Хорошая новость в том, что дистимия хорошо поддается лечению. Терапия и медикаментозное лечение могут помочь сбалансировать ваше настроение, чтобы болтовня отошла на второй план. Забота о себе в качестве приоритета и овладение навыками преодоления трудностей также оказывают поддержку.

Важно поговорить со своим врачом, если вы чувствовали себя подавленным чаще, чем нет в течение длительного времени. Обращение за помощью - это первый шаг к тому, чтобы снова почувствовать себя самим собой. Вам не нужно бороться с постоянным плохим настроением в одиночку. Есть люди и ресурсы, которые помогут облегчить нагрузку. У вас это есть!
""";
      case 5: finalText = """Встреча лицом к лицу со своими демонами: понимание ПТСР

Чувствовали ли вы, что не можете убежать от прошлого? Как будто страшные воспоминания продолжают вторгаться, хотите вы этого или нет? Возможно, у вас посттравматическое стрессовое расстройство, также известное как ПТСР.

ПТСР часто развивается после ужасающего события, когда вы опасались за свою жизнь, например, боя, нападения, несчастных случаев или стихийных бедствий. Даже если угроза миновала, ваш мозг и тело все еще могут находиться в состоянии повышенной готовности, заставляя вас большую часть времени испытывать стресс или тревогу.

При ПТСР повторное переживание травмы является обычным явлением. Громкие звуки или места, напоминающие вам об этом событии, могут вызвать воспоминания или ночные кошмары. Вы пытаетесь избегать всего, что связано с травмой. ПТСР может нарушить вашу повседневную жизнь, если его не лечить.

Хорошей новостью является то, что ПТСР легко поддается лечению. Терапия помогает вам безопасно осмыслить случившееся, чтобы прошлое имело меньшую силу. Лекарства также могут смягчить симптомы. При поддержке вы можете исцелиться от травмы.

Помните - наличие ПТСР не означает, что вы слабы. Это показывает, насколько вы стойко пережили. Поговорите со своим врачом, если у вас есть симптомы ПТСР. Они могут помочь вам начать путь к тому, чтобы чувствовать себя более уверенно и умиротворенно. У вас это есть!
""";
      case 6: finalText = """Стать на место другого человека - понимание эмпатии

Вы когда-нибудь замечали, как некоторые люди, кажется, просто "понимают", что чувствуют другие внутри? У них есть дар, называемый эмпатией.

Сопереживание - это видение мира глазами другого человека. Это ощущение того, что эмоционально может испытывать кто-то другой. Когда вы сопереживаете, вы представляете, каково это - ненадолго оказаться на месте другого.

Сочувствие не означает необходимость исправлять людей или принимать их чувства как свои собственные. Речь идет о понимании того, откуда они берутся, без осуждения. Вы слушаете с открытым сердцем и отражаете то, что слышите, чтобы показать, что понимаете.

Сопереживание делает отношения крепче. Это помогает уменьшить конфликты, потому что вы видите проблемы с разных сторон. Когда вы сопереживаете, люди чувствуют, что их слышат и о них заботятся. Это создает среду, в которой люди тоже хотят понимать вас.

Хорошая новость в том, что эмпатии можно научиться. Ставить себя на место других требует практики, но чем больше вы это делаете, тем легче. Забота очень много значит для людей. Держите разум и сердце открытыми - у вас это получится!
""";
      case 7: finalText = """Мы все, время от времени проходим через взлеты и падения. Но также важно обращать внимание на свое психологическое благополучие. Как и физическое здоровье, психическое здоровье заслуживает заботы и внимания.

Когда ваше психическое здоровье хорошее, вы можете справиться со стрессом и трудными временами. Вы чувствуете себя вовлеченным в жизнь и способен внести свой вклад. Но если ваше психологическое благополучие не так жарко, даже небольшие проблемы могут показаться огромными.

Есть вещи, которые мы все можем сделать, чтобы поддержать наше психическое здоровье. Выразите свои чувства в дневнике или друзьям. Высыпайтесь, правильно питайтесь и занимайтесь спортом - все это влияет на ваше мышление. Найти время для отдыха.

Также можно обратиться за помощью, если она вам нужна. Разговор с консультантом может дать вам новые перспективы и навыки преодоления. Лекарства могут помочь, если симптомы тяжелые. Протягивание руки показывает мудрость, а не слабость.

Ваше психическое здоровье имеет такое же значение, как и физическое. Будьте добры к себе - вы заслуживаете того, чтобы чувствовать себя эмоционально здоровым и спокойным. Небольшие усилия каждый день могут иметь большое значение. У тебя есть это!
""";
      case 8: finalText = """Кажется, что беспокойства накапливаются? Вы чувствуете себя подавленным или на грани? Это реакция вашего тела на стресс в действии. Но не расстраивайтесь - есть много вещей, которые вы можете сделать, чтобы чувствовать себя более контролируемым и менее напряженным.

Глубокое дыхание - это быстрый способ успокоить нервы. Медленно вдохните через нос, почувствуйте, как поднимается живот, а затем выдохните изо рта. Подсчет вдохов отвлекает ваш разум от того, что вас беспокоит.

Упражнения также очень снимают стресс. Даже 10-минутная прогулка может поднять настроение. Быть активным также помогает вам лучше спать. Другая идея - вести дневник благодарности. Запишите три вещи, которые вы цените каждый день. Это смещает ваше внимание на положительные стороны.

Обязательно расслабьтесь и делайте что-то, просто для развлечения, будь то прослушивание музыки, игры или тусовка с друзьями. Смех снимает напряжение и позволяет вам зарядиться энергией.

Помни - ты не сверхчеловек. Иногда можно сказать "нет" или попросить других о помощи. Будьте добры к себе и не придирайтесь к себе из-за стресса - это очень нормально. У тебя есть это! С практикой вы будете чувствовать, что стресс лучше контролируется, чем он контролирует вас.
""";
      case 9: finalText = """   Эмоциональное спокойствие отождествляют с душевным спокойствием (хотя это понятие явно шире) и подразумевают состояние особого комфорта, которое характеризуется чувством умиротворенности, безмятежности и блаженства. В это время человек чувствует себя гармонично. 
   Эмоциональное или душевное спокойствие свойственно людям:
-	настроенным оптимистично;
-	умеющим контролировать эмоции;
-	обладающим достаточным уровнем устойчивости к стрессу;
-	получающим удовольствие от жизни в любых ее проявлениях.
   При эмоциональном или душевном спокойствии отмечается отличное самочувствие и здоровье в психологическом плане, наличие конструктивных мыслей. Именно в таком состоянии человек способен достигать намеченных целей, помогать близким и страждущим, делать добрые дела и прочее. Эмоциональное или душевное спокойствие – условие высокой эффективности в деятельности, социальных контактах и поведении.
   Эмоциональное или душевное спокойствие обусловливается:
1)	согласованностью, потребностей и желаний с реалиями действительности и возможностью их удовлетворения;
2)	установками и отношением к разным аспектам жизни;
3)	состоянием здоровья и самочувствием;
4)	насущными настроениями и переживаниями (страдающий от чувства одиночества, едва ли будет удовлетворен и спокоен);
5)	верой в свои способности решить поставленные задачи и иными обстоятельствами.
   Состояние, противоположное эмоциональному и душевному спокойствию, является тревожность. «Тревожность — это психологическая особенность человека, которая обусловлена беспокойством или предчувствием чего-то плохого». Значение тревоги в жизни человека велико. Тревога сигналит об опасности и диктует реакцию: «бей или беги», предлагая человеку активно защищаться или скрыться от опасности. На ранних этапах развития человечества с помощью таких реакций человек реагировал на многочисленные опасности. В настоящее время потенциальных «опасностей» меньше не стало, но они изменили облик. Сегодня угроза: чрезмерно требовательный начальник, поток машин на дороге, и финансовая нестабильность, и проблемы личной жизни, войны, природные катаклизмы и так далее… Но далеко не на каждую подобную ситуацию есть возможность активно реагировать – чаще чувство тревоги игнорируется, проглатывается обида, молча переживается дискомфорт. Невыраженные эмоции накапливаются и приводят к срыву механизмов адаптации организма – развивается патологическая тревожность и заболевания, которыми она проявляется.
   Тревожность изначально появляется ситуативно, как реакция. При многократных повторениях она закрепляется и превращается в черту личности. 
   Тревожность – черта личности, которая проявляется в возникающем по незначительным поводам чувстве волнения, переживания, беспокойства. Она может быть просто индивидуальной особенностью, вариантом нормы либо признаком органического или функционального нарушения в организме. Чувство тревоги, возникающее часто, в определенных условиях либо вне конкретной ситуации, без повода, причиняет человеку значимый дискомфорт, мешает полноценно функционировать в обществе, ухудшает качество жизни. Чтобы справиться с повышенной тревожностью, следует прежде всего выяснить причины ее возникновения.
   Опасность тревоги и тревожности состоит в том, что она может стать акцентуированной чертой личности или привести к развитию психических заболеваний (психопатии). Среди некоторых из них она занимает один из ведущих симптомов. Тревожность сопровождает все виды психических нарушений, возникших на фоне стрессов (посттравматическое стрессовое расстройство, адаптационное расстройство; паническое расстройство; тревожно-депрессивное расстройство; генерализованное тревожное расстройство и иные). Тревожность при этом может быть представлена паническими реакциями или реакциями тревоги в некоторых обстоятельствах (лифт, посадка в автобус, публичное выступление).
   Обычно тревожность и ее признаки возникают сразу после воздействия стрессовой ситуации или не позднее шести месяцев с момента ее окончания.
   При сопровождении органической патологии тревожностью, у пациента будут определяться и симптомы основного заболевания (устойчивое повышение артериального давления как проявление гипертонической болезни; сухость кожи, экзофтальм, выпадение волос, колебания веса как признаки патологии щитовидной железы; общая слабость, бледность как симптомы анемии).
   Тревожность может быть индивидуальной особенностью, которая проявляется в склонности постоянно ощущать сильную тревожность по незначительным поводам. Она может выступать особенностью темперамента, вследствие слабости нервных процессов. Нередко в ней усматривают единство личностных реакций и особенности темперамента.
   Легкая тревожность возникает у нас ежедневно и неоднократно из-за воздействия стрессовых факторов, выполняя и важную положительную роль в нашей жизни – защищая от вредностей и опасностей. Развитие генерализованного тревожного расстройства сильно ухудшает жизнь человека, принуждая думать только о нерешенных задачах и других объектах, вызывающих беспокойство, видеть худшее развитие событий, испытывать напряжение, беспокойство, тревогу на протяжении всего дня, без видимой причины. 
   Тревога способна изменить самочувствие, вызывая суетливость поведения, мышечные напряжения, дрожь, невозможность расслабиться, потливость, тахикардия, сухость во рту. 
   Тревожность меняет поведение, в нем начинают отмечаться: перфекционизм, чрезмерная самокритика, страх совершить ошибку, сделать что-либо не так.
   Специалисты выделяют причины тревожности:
- генетическая предрасположенность («химический перекос» и дисбаланс становятся причиной тревожности);
- неправильное питание (нарушение пищевого поведения являются следствием тревожности и провоцирует тревожные реакции, особенно нехватка витаминов группы В);
- отсутствие физической активности (сила и выносливость организма – лучшее профилактическое средство тревожности);
- негативное мышление (отрицательные установки, мысли, отражающие неблагоприятное развитие событий, мрачные образы воображения – интоксикация мышления, вызывающая тревогу);
- негативный опыт (промахи и ошибки заставляют страшиться, как выполнить те или иные задачи);
- соматические заболевания (недомогание и неблагоприятные симптомы заставляют тревожиться о перспективах здоровья и жизни);
- окружающая среда (недружественная среда, непринимающая, и вовлекающая в конфликты принуждает тревожится).
   Проявления тревожности определяются ее типом:
- личностная тревожность;
- ситуативная;
- мобилизующая;
- расслабляющая;
- открытая;
- скрытая.
   1 Личностная тревожность проявляется в устойчивой склонности к тревожности и волнениям в независимости от тяжести жизненных обстоятельств. Отличается ощущением необъяснимого страха и угрозы. Человек готов все события воспринимать как опасные;
   2 Ситуативная тревожность вызывается определенной ситуацией либо событием, которое порождает беспокойство;
   3 Мобилизующая тревожность дает дополнительный посыл к действиям;
   4 Расслабляющая тревожность – в ответственные моменты парализует личность. Интересно, что состояние тревожности изменяется во времени как функция степени стресса, которому подвергается человек и варьируется по интенсивности;
   Скрытую тревожность сложно обнаружить: внешне она может быть скрыта от других, ее проявления могут быть представлены вегетативными реакциями, ощущаемыми только самим индивидом. Из-за незаметности эта тревожность является более опасной. Открытая тревожность имеет классическое выражение. Именно с этим видом традиционно приходится сталкиваться.
   Тревожность, которая приобрела постоянную основу, требует специальных методов лечения. Среди проявлений тревожности, требующих внимания и серьезного отношения:
   Социофобия. Человек избегает контактов с другими людьми, остро реагирует на то, как к нему относятся окружающие.
   Генерализированное тревожное расстройство. Это постоянное и острое чувство беспокойства и переживания по незначительным поводам — например, если близкий человек задерживается на работе. Как правило, тревога сопровождается физическими симптомами: боли в сердце, «холодный пот», дрожь.
   Тревога, связанная с состоянием здоровья. Такое расстройство может появиться у людей с хроническими заболеваниями. Например, страдающие бронхиальной астмой часто боятся задохнуться или потерять ингалятор.
   Разнообразные фобии. Сюда можно отнести страх полетов, боязнь замкнутых пространств, которые ограничивают человека в передвижениях.
   Панические атаки. Они чаще всего сопровождаются учащенным сердцебиением, отдышкой, головокружением.
   Все указанные симптомы требуют обращения к специалисту, и это ни в коем случае нельзя откладывать на потом.
""";
      case 10: finalText = """   Уверенность в себе – характеристика, основанная на знании самого себя и вере самому себе, вере в свои силы. Устойчивая вера в себя складывается на основе многократных проверок своих возможностей в решении задач и не отрицает вероятность ошибок.  Напротив, уверенный в себе индивид, дает себе право на ошибку, понимая, что нельзя сразу, с первой попытки успешно решить задачу. Именно это право и обеспечивает его продвижение вперед к новым вершинам, к новым возможностям, что расширяет и укрепляет его веру в себя.
   "Уверенный в себе" - это не тот, который всё может и всё знает, а тот, который осознает свои способности и ограничения. Это тот, кто выбирает такие задачи, решение которых ему по силам. И если пока не по силам, он готов развиваться, а не отказываться от новых шагов из опасения, что ничего не выйдет.
   Уверенный в себе человек, как и все остальные, сомневается, страдает и не знает правильного ответа. Но он действует и готов встретиться с последствиями. А если эти последствия окажутся не тем, чего он хотел, он сумеет себя поддержать и попробует снова. Уже по-другому, с учётом прошлых ошибок.
   Вера в себя должна быть обоснована, иначе принято говорить о самоуверенности, не подкрепленной и не проверенной практическим опытом. Необоснованная вера неустойчива, она нарушается при первых ошибках. Сомнения овладевают индивидом и мешают ему выполнять требуемые задачи. Частые неудачи закрепляют неуверенность и провоцируют чувство беспомощности. 
   Неуверенный в себе тяжело переживает свою несостоятельность, чувствует себя неполноценным и неспособным. Неуверенность сдерживает развитие индивида в разных направлениях, обусловливает социальную изоляцию на фоне переживания неудач и блокирует его активность. Она может провоцировать депрессию и другие неприятные явления. Даже изначально уверенный в себе человек, пережив череду неудач в решении жизненных задач, может потерять веру в себя. Уверенность в себе – хрупкое явление, требующее постоянного положительного подкрепления.
   Уверенность берет свои истоки в детстве с чувства стабильности и надежности внешней ситуации. Доверие родителям, обстановке, в которой растет и воспитывается ребенок, создает условия для веры другим и миру. Первые удачно решенные задачи при взаимодействии с предметами, нашедшие похвалу взрослых, предопределяют возникновение первых «ростков» веры, которые быстро множатся и растут на основе взаимодействия с миром. Благополучный опыт взаимодействия создает основу для веры себе. Ошибки заставляют сомневаться в себе, многократные закрепляют переживание неудач, обусловливая тотальное неверие себе. 
   На формирование уверенности влияют не только оценки, высказанные в адрес ребенка взрослыми, и опыт преодоления трудностей и решения задач. Ее обусловливает благоприятный психологический климат – среда, предоставляющая возможность пробовать себя и проверять, поддерживающая и вселяющая надежду. Негативно на способности верить в себя сказывается неопределенность. Противоречивые факты, недостаток информации или избыток дезориентируют индивида, и он теряется, не зная, как поступить.
   Неуверенность в себе предопределяет: восприятие любых препятствий как неодолимых, тревожность, пассивность, несамостоятельность, отказ от решения задач, инфантилизм, агрессивность, негативизм, эгоистичность, низкая самооценка, боязнь общения, неспособность чувствовать личностные границы, самоуверенность и иные последствия. Неуверенность в себе заставляет переживать неприятные эмоции: тревогу, вину, страх, стыд. Она переживается тягостно и требует коррекции.
""";
      case 11: finalText = """   Психическое состояние является основой психологической активности – поведения и деятельности. Оно влияет на степень активности индивида, и само обусловливается спецификой поведения и деятельности.
   Нервно-психическое напряжение – специфическое психоэмоциональное состояние, возникающее вследствие информационных и эмоциональных перегрузок, необходимости действовать в режиме многозадачности, в условиях, требующих высокой ответственности и оперативного принятия решений. Нервно-психическое напряжение появляется при длительном напряженном труде, в обстановке эмоционального накала и блокирования важных потребностей. К нему приводит накопление невыраженных эмоций. Оно обусловливает желание изолироваться, уехать по манере Грибоедова «в деревню, к тетке, в глушь, в Саратов».
   Нервно-психическое напряжение развивается постепенно в условиях, требующих повышенных умственных, физических и эмоционально-волевых ресурсов организма. Различают степени нервно-психического напряжения.
При первой степени, индивид перестает замечать, что действует в режиме сверх привычных возможностей, в ущерб своим интересам и потребностям, не замечая за работой, что рабочее время давно исчерпано.
При второй степени – работа требует полной мобилизации ресурсов и перестройки физических и психических процессов. Увлеченность решением задач сохраняется, но очевидны следы усталости и потребность в отдыхе. 
При третьей степени – резкое снижение физических, интеллектуальных и эмоциональных ресурсов, иммунитета, сужение и ухудшение концентрации внимания, памяти, проявление личностной слабости, неспособности решить поставленные задачи в срок или в общем. Требуется срочный отдых.
При четвертой степени – признаки выраженного невроза, требующего лечения в условиях специализированной клиники. 
   Профилактика: регулирование продолжительности труда и других форм активности в условиях, требующих полной мобилизации физических, интеллектуальных и эмоционально-волевых ресурсов.
""";
      case 12: finalText = """   Психологическая устойчивость – категория, соотносимая с психологическими характеристиками: стабильность, самоконтроль, фрустрационная толерантность, стрессоустойчивость, устойчивость к травмирующим ситуациям, устойчивость к неопределенности, помехоустойчивость, устойчивость к нарушению норм и границ, устойчивость к конфликтам и другие. 
   Психологическая устойчивость отражает эмоциональную устойчивость к конкретному стрессогенному фактору, и отражает толерантность или снижение чувствительности к его воздействию. Психологическая устойчивость эквивалетна стрессоустойчивости, устойчивости к неопределенным или травмирующим событиям, она связана со способностью избегать патологических последствий стрессовых ситуаций и нарушений психических процессов. Она соотносится с помехоустойчивостью и характеризует адекватное, предсказуемое, взвешенное поведение личности, оптимальную ее деятельность. Важную роль при этом отводят самоконтролю. Она связана со способностью к саморегуляции.
   Нервно-психическая устойчивость – способность индивида длительно проявлять высокий уровень интеллектуальных, эмоциональных и волевых возможностей в условиях интенсивных стрессовых воздействий ситуации, и сохранять достаточный уровень продуктивности деятельности и поведения.
   Психологическую устойчивость обеспечивают интеллектуальный, волевой и эмоциональный компоненты. На нее влияют: 
-биологический – возможности нервной системы: сила, подвижность и уравновешенность нервной системы;
-психологический – возможности психики (познавательные, эмоциональные и волевые психические процессы); способность субъекта деятельности сохранять работоспособность познавательных, эмоциональных и волевых процессов в границах психической нормы устойчивости;
- социальный – способность субъекта деятельности сохранять общественно-полезную работоспособность. 
   Психологическую устойчивость характеризуют:
- ощущение контроля за своей жизнью;
- состояние вовлеченности в деятельность, отношения с другими людьми и с самим собой;
- оценивание происходящих в жизни изменений скорее, как вызова, а не как угрозы.
   Психологическая устойчивость понимается, с одной стороны, как характеристика, отражающая способность личности сохранять стабильность. В таком случае, она может рассматриваться в связи с личностными качествами: ригидность, инертность, консерватизм.
   С другой стороны, психологическая устойчивость может трактоваться, как устойчивость как позитивный результат преодоления сложной жизненной ситуации можно наблюдать преимущественно у тех индивидов, кто способен активно взаимодействовать с окружающей средой и активировать собственные ресурсы, необходимые для повышения субъективного благополучия и защиты от факторов риска. Понимание психологической устойчивости с позиции гуманистической психологии акцентирует внимание на способности личности использовать ресурс травмирующей ситуации для личностного роста и формирования соответствующих посттравматических способностей. Отечественные психологи считают ее свойством личности, позволяющим психике находить продуктивный выход из стрессовой ситуации.
   Психологическая неустойчивость – свойство личности, характеризующее неспособность противостоять стрессу, обусловленное особенностями темперамента (индивид со слабым и неуравновешенным типом нервной системы имеет малые шансы совладания со стрессом; малая подвижность нервных процессов не позволит быстро подобрать модель поведения в соответствии с требованиями ситуации), сбоями и нарушениями в функционировании психических процессов (недостатки внимания, неточности образов восприятия и недостатки мыслительных функций в купе в эмоциональной реактивностью и лабильностью – причины эмоциональной неустойчивости) и недостатки социального порядка – способность вступать в контакт, опираться на социальную помощь и поддержку.
   Если рассматривать психологическую устойчивость через призму психических процессов, то очевидно, что она связана с неспособностью адекватно эмоционально отреагировать на стрессовую ситуацию и совладать с ее обстоятельствами, правильно оценивать их, определять способы выхода из затруднительной ситуации, проявить решительность и настойчивость в преодолении сложностей ситуации.
   Психологическая неустойчивость связана со слабым контролем, перепадами настроения, импульсивными реакциями и нервным срывам. При психологической неустойчивости характерна повышенная раздражительность, неспособность себя контролировать и управлять своим поведением.
   Психологическая (эмоциональная) неустойчивость может быть:
   Импульсивной – проявляется излишней возбудимостью. Стрессогенные факторы провоцируют уверенность в то, что весь мир на настроен против них, вокруг одни испытания, окружающие желают зла. Детям с импульсивным типом реакции на стресс свойственна капризность, обидчивость, склонность устраивать истерики, проявлять агрессию, как словесную, так и физическую.
   При неудачной попытке стать лидером, индивид уходит в себя, замыкается, обозляется, способен на совершение демонстративных неадекватных поступков, приступы частого гнева.
   Пограничной – бурное и яркое воображение; излишняя впечатлительность; подвижность когнитивного восприятия; аффективная лабильность не гарантирует благополучного выхода из стресса. Личности с пограничным типом неустойчивости, напротив, свойственна: неспособность адекватно относится к жизненным трудностям - любая преграда, вставшая на пути, любая неудача и ошибка, воспринимаются мучительно и болезненно. Имеющиеся испытания воспринимаются, как невыносимо сложные, не переживаемые. Индивид не выдерживает напряжения от ситуации и нередко становится алкоголиком, наркоманом, совершает преступление, уходит в депрессивное или истерическое состояние. Повышенная привязанность препятствует самостоятельным реакциям и решениям
   Неустойчивая психопатия на фоне психологической неустойчивости может развиться в шизофрению. 
   Истоки пограничной психологической неустойчивости появляются в период полового созревания, и проявляется неусидчивостью, перепадами настроения, невнимательностью и фрустрацией. Лиц с пограничной психологической неустойчивостью стрессовые ситуации провоцируют к угрозам близким суицидом. Они с большой вероятностью при неудаче могут применить парасуицидальное поведение, цель которого манипуляция и вымогательство.
   Лица с психологической неустойчивостью нуждаются в наблюдении и контроле близких и требуют помощи специалистов.
""";
      case 13: finalText = """   Реакция тревоги и тревожность как свойство личности требуют вмешательства и коррекции.
   1.	Почувствовав тревогу или страх, первое, что можно сделать – это последовать примеру предков и позволить организму выполнить требуемое ситуацией действие – «бег». Второй вариант – нанести удар в целях защиты. Однако он не является удачным решением, поскольку может вызвать ответную реакцию. Бег – допустимая и оправданная реакция. Благодаря ему удастся сбросить создавшееся напряжение. Удар, направленный на конкретное лицо, провоцирует ответную агрессивную реакцию. Потребность в действии-ударе может быть реализована в таких видах спорта, как теннис, бадминтон, отчасти волейбол. Разумным решением для снятия напряжения, вызванного тревогой (или тревожностью), станет выбивание ковра или рассекание воздуха гибким прутом.
   2.	Бег можно заменить ходьбой в быстром темпе на далекие расстояния. Если ситуация не позволяет это реализовать, возможны перемещения по комнате, коридору на расстояние в несколько шагов. Оптимально сочетать ходьбу с дыхательными упражнениями, обучающими контролю ситуации (два шага на вдох, три на выдох).
   3.	Оперативно снять состояние тревоги можно с помощью дыхательных техник, добиваясь медленного и спокойного дыхания. Допустимо при этом использовать вспомогательные движения: дирижирование, отбивание ритма ногой. Возможен контроль глубины дыхания рукой, расположенной внизу живота. 
   В процессе выполнения дыхательных техник может намеренно меняться частота дыхательных движений, их ритм и глубина. Управление дыханием отвлекает сознание от тревожных переживаний и нормализует эмоциональное состояние. Важно добиваться глубокого вдоха, снимая напряжение в области груди, выдерживать паузу перед вдохом, обеспечивая максимальное освобождение организма от воздуха. Если осуществлять глубокий вдох через нос, а интенсивный выдох – через рот, складывая губы трубочкой, повторяя несколько раз дыхательный цикл, можно обеспечить приток кислорода к мозгу.
   4.	Упражнения «Пять жемчужин» снимут напряжение посредством вовлечения в физическую активность нескольких групп мышц. Во время выполнения упражнений происходит интенсивное наполнение мозга кислородом, что улучшает качество мыслительной деятельности. Индивиду удастся быстрее найти требуемое решение по выходу из ситуации, вызвавшей тревожность. 
   5.	Необходимо добиться расслабления вовлеченных в реакцию тревоги мышц, поочередно напрягая их. Места наибольшего напряжения: рот, нижняя челюсть, область виска, губы, шея, затылок, плечи, живот. На вдохе следует максимально, до дрожи напрягать места зажимов, на выдохе – расслаблять мышцы, сбрасывая напряжение резко.
   Зажим, который не получается снять напряжением-расслаблением, можно ликвидировать или ослабить массажными движениями. Успешными могут оказаться и упражнения по созданию гримас. 
   6.	В целях снятия тревожности рекомендуется интенсивно массажировать мочки ушей. 
   7.	Если позволяет обстановка, можно воспользоваться упражнением. Принять положение лежа на коврике, ноги поднять под углом 90º, ступни потянуть к себе, руки свободно расположить вдоль тела. Постараться удерживать положение на протяжении 7-10 минут, затем, согнув ноги в коленях, снять напряжение, барабаня ступнями по поверхности.
   8.	Вступая в борьбу с тревожностью, целесообразно определить ее причины. Чаще всего, она провоцируется неясностью ожидания, связанных с будущим. В связи с этим целесообразно включиться в составление прогнозов и оценку последствий при разных вариантах развития событий. Увлеченность прогнозами и планами отвлечет от насущных переживаний.
   9.	Используйте приемы визуализации для конструирования способов выхода из создавшихся ситуаций. 
   10.	Используйте все сенсорные каналы и возможности (слуховые, зрительные, вкусовые, обонятельные, тактильные) для создания в воображении образов благополучия. Пусть это будут совершенно неизвестные Вам, новые образы, отражающие ситуации вашего комфорта, благополучия, удовлетворения.
   11.	Вернитесь, благодаря Вашей памяти, в ситуации, когда Вам было максимально комфортно. Вспомните их детали: визуальные образы, тактильные ощущения, слуховые и прочие. Возобновите всю картину и палитру ощущений целиком. Запомните. Когда возникнет новый приступ тревожности, воспользуйтесь этой ситуацией душевного спокойствия и эмоционального благополучия.
   12.	Применяйте техники самопрограммирования. Оглянитесь назад и вспомните период Вашей успешности. Возобновите ситуации, в которых Вы были «выше обстоятельств», когда Вы их благополучно преодолевали. Задайте установку: «Я готов к благополучному решению и этой ситуации», «У меня есть все ресурсы для успешного исхода», «Я могу!», «Я справлюсь!».
   13.	Установки на благополучное решение проблемы, задачи можно подкрепить упражнением из телесно-ориентированной психотерапии. Поставьте ноги на ширине плеч, руки вытяните перед собой. При произнесении слов «Я смогу!», «Я справлюсь!», «У меня получится!» медленно приседайте (до полуприседа), высвобождая свое тело от воздуха (выдыхая) и сопровождая фразой. Допустим звучный выдох.
   14.	Снижению тревоги способствует повышение внутренней веры и решимости. Повышение физических возможностей организма и выносливости позволяет чувствовать себя психологически сильнее. Бег по пересеченной местности на длинные дистанции, кардиотренировки, подъем по лестнице и упражнения с гантелями помогают повысить физический ресурс организма.
""";
      case 14: finalText = """   1.	Признайте свое право испытывать сомнения в своих возможностях и способностях. Запомните: «Не ошибается только тот, кто ничего не делает!». Избегание осознания личностного несовершенства и слабости дает точку опоры. Право на ошибку позволит действовать, не опасаясь неудачи. 
   2.	Чтобы поддержать себя, начните с привычных задач. Беритесь за простые дела, накапливая опыт успеха. Повышайте свою самооценку в решении каждой задачи.
   3.	Учитесь слышать себя и верить себе. С вниманием отнеситесь к своим чувствам, разберитесь, что стало их причиной, проанализируйте последний неудачный опыт. Что обусловило неудачу: отсутствие способностей или боязнь, что не хватит умений, отказ от каких-то действий, неудачный опыт и прежние ошибки или острые негативные переживания, нежелание взять на себя ответственность или боязнь неоправданного ожидания внешней поддержки. Найдите причину Вашего отказа от решения требуемой задачи.
   4.	Составьте список своих умений и навыков, которые могут понадобиться для решения определенной задачи, приведите личностные качества, которые могут привести к успеху. Вспомните о волевых и эмоциональных ресурсах. Потом действуйте.
   5.	Будьте в меру требовательны к себе. Не стоит ожидать успеха во всем и сразу. Так не бывает. Человек может преуспевать в одном, но не совсем удачно справляться с другим.
   6.	Не ставьте знак равенства между личностью и ее достижениями. Это чревато неприятными последствиями: преувеличение своих возможностей и личностных достоинств также неблагоприятно, как и недооценка, вызывающая неуверенность. Опыт одного дня не должен стать основой для многих или всех дней. 
   7.	Используйте стратегию «маленьких шажков» или «маленьких побед», не гонитесь за глобальными и ежесекундными успехами. Двигайтесь постепенно и поступательно, без существенных остановок. Формируйте день за днем опыт успеха. Фиксируйтесь на достоинствах, тщательно разбирайте ошибки.
   8.	Избегайте когнитивных искажений. Учитесь мыслить позитивно и гибко, используя «полутона». Дихотомичное «черно-белое мышление», отражающее категоричность, мешает адекватному восприятию вещей и событий. Не стоит принимать решение о вовлечении в задачу, опираясь на установку «идеально или никак», «успешно, или я за это не берусь!».
   Старайтесь не воспринимать жизненные обстоятельства, как катастрофу, из которой нет выхода. Учитесь искать множество решений из любой ситуации. Превратите этот поиск в увлекательное занятие.
   Не переоценивайте значение единичных событий, неудачных решений и ошибок. Сдерживайте внутреннего критика. Не обязательно Ваша ошибка вызовет какие-то существенные поступки или действия окружающих. 
   Не фокусируйтесь на реакциях других («посмотрел странно на меня, наверное, что-то не так», «вышел стремительно из кабинета, наверное, ему неприятно находиться рядом с неудачником»), они не имеют к Вам никакого отношения. Это их реакции, Ваши проявляете Вы. Чаще всего эмоции и поступки других отражают их внутренние переживания и мысли, имеющие отношения к ним самим. 
   9.	Оградите себя от неприятного окружения. Сложно научиться верить в себя рядом с теми, кто во всех поступках выражает неуверенность. Невозможно учиться вере в позитивный исход рядом с теми, кто рисует мрачные перспективы. Трудно взращивать веру в себя рядом с теми, кто только и делает, что сравнивает себя с другими, причем не в пользу для себя.
   10.	 Начните действовать. Будьте решительны в выборе дел. Предпринимайте маленькие шаги, доверяя себе. Верьте в свою уникальность и развивайте свои особенности, они – лучший источник веры.
""";
      case 15: finalText = """   1.	Дыхательные упражнения. 
   Примите удобную позу. Оптимально, если Вы присядете. Постарайтесь расслабиться. Выполните несколько дыхательных упражнений или проведите дыхательную тренировку. Проверьте, как глубина и частота дыхания влияют на ваше состояние.
   1.1.	Дышите быстро и часто, как бегун после пробежки. Старайтесь дышать поверхностно, грудью. За одну секунду сделайте и вдох, и выдох. Продолжительность — 20-30 секунд. Теперь сравните ваше самочувствие до упражнения и после него. Вы почувствуете определенное нервное возбуждение.
   1.2	Расправьте плечи и дышите медленно и глубоко. Глубоко вдохните, делая глубокие вдохи порционно, на счет: «один, два, три, четыре» плавно выдыхайте, разделяя выдох на 4 порции. Повторите цикл вдох-выдох 7-10 раз. Дирижируйте, помогая себе. Вновь обратите внимание на свое самочувствие. Вы чувствуете гораздо больше спокойствия и расслабления, не правда ли?
   1.2.	Теперь положите руку на низ живота и постарайтесь повторить глубокое дыхание. Воздух должен достичь низа живота и приподнять Вашу руку. Подышите, выполняя эти условия, несколько минут. Теперь Вам намного лучше. Напряжение ушло или значительно ослабло.
   2.	Обратитесь к положительному опыту прошлого. Подумайте о самом приятном, что происходило с Вами в лучшее время (этим летом, в особый для Вас день…), почувствуйте удовольствие и спокойствие этих чудесных моментов. Вернитесь в приятную ситуацию и зафиксируйте добрые переживания, чувства, состояние. Задержитесь в нем. Сохраняйте спокойное ровное дыхание, выдерживая плавность и темп.
   Можно по аналогии предаться приятным мечтам.
   3.	Отвлекитесь. Метод отвлечения поможет увести Ваше сознание от тревожащего или раздражающего объекта. Он избавит от навязчивых мыслей, возбуждения и неприятных эмоций. 
   Вариант 1. Посмотрите в окно или на любой предмет. Изучите его характеристики: форму, цвет, параметры, другие свойства. Рассмотрите детали, подумайте, что поменяется в этом объекте при других условиях. Поищите в нем что-то особое, новые, скрытые ранее от Вас качества. 
   Подумайте, где и как Вы могли бы применить их, помимо известных способов. Например, рассмотрите дерево за окном. Что напоминает ствол его дерева, какие фигуры усматриваются в кроне? Каков цвет листьев и соответствует ли он поре года? Вспомните, каким цвет листьев был еще недавно, как изменится дерево при смене поры года? Что новое увидится в кроне дерева, когда листва облетит, или, напротив, появится? Какие новшества в это дерево привносит украшение снегом? Попутешествуйте с выбранным деревом по порам года, через года. Каково Ваше нервно-психическое состояние? Обрели спокойствие. Зафиксируйте это чувство. Теперь Вы можете использовать образ дерева, когда Вам станет не по себе.
   Вариант 2. Возьмите в руки предмет и закройте глаза. Сожмите ладонь, как можете сильно, зажав предмет, разожмите. Повторите несколько раз (7-10). Почувствовали себя лучше? Отлично! Покатайте предмет по ладони, ощупайте его, изучая его поверхность, отмечая гладкость и шероховатости, постарайтесь отметить, запомнились ли Вам его особенности. Что напоминает предмет? Вы смогли бы нарисовать узор поверхности предмета? Прокатите предмет по щеке, по лбу. Что Вы чувствуете? Как ощущаются его неровности разными участками тела? Выполните снова упражнения по зажиманию предмета ладонью. Прокатите предмет по ладони после интенсивных напряжений и расслаблений. Наверняка, Вам уже лучше, и Вы чувствуете себя спокойным и расслабленным.
   4.	Используйте метод самоприказа, чтобы оптимизировать нервно-психическое состояние. Отдавайте команды. «Что это я напрягся? Чего испугался? Я смогу! Я сумею выполнить эту задачу!» «Соберись, (обратитесь к себе по имени)!», «Ты сможешь!», «Ты справишься!», «У тебя получится!».
   Лучше сопроводить технику приказа предварительным воспоминанием ситуации успеха из прошлого. Пережить заново чувства, сопровождающие успех, и переживания, испытываемые накануне успеха. «Вспомни, как успешно ты справился со сложным делом, порученным месяц назад!». Возобнови в памяти переживание успеха, насладись этими чувствами. Перенеси тот опыт на нынешнюю ситуацию!» 
   В процессе формирования настройки на благополучное выполнение поставленной задачи, определить слагаемые, которые обеспечат успешный результат. Рекомендуется погрузиться в поиск факторов, которые помогут достичь успеха.
   5.	Примените метод концентрации внимания. Концентрируйте внимание на любом предмете. Старательно изучайте его сантиметр за сантиметром, деталь за деталью. Находите новое, отмечайте незамеченное. Мысленно увеличьте предмет, уменьшите, что Вы увидели новое? Сравните его детали и свойства до и после увеличения, уменьшения. Определите, что изменится, если Вы его мысленно сузите, растяните. Экспериментируйте, смело. Будьте находчивы. Старайтесь удерживать внимание на объекте, не моргая, учитесь не отвлекаться на другое, как минимум в течение 3-5 минут. Получается? Вы еще чувствуете напряжение?
   6.	Используйте метод «Мышечного расслабления». 
   Напряжение обычно возникает в ответ на ситуацию, которая оценивается стрессовой. При ней выброс гормона стресса - кортизола, заставляет мышцы напрячься. 
   В напряжении, сопряженном с тревогой, можно выделить 4 компонента:
   1. мысли: «у меня не получится», «я не справлюсь», не сумею и так далее;
   2. эмоциональная реакция тревоги; 
   3. физическая реакция: мышечное напряжение; 
   4. Поведенческие реакции, условно разделяемые на «пассивно-оборонительные» - неэффективные и «активно-оборонительные» - защищающие организм от последствий стресса, соматических сбоев и заболеваний, от гибели.
   «Пассивно-оборонительные реакции» разнообразны: избегание ситуации, измерение давления, походы к врачам, чтение про опасные заболевания, и даже ступор. Неэффективный вид обороны   паническая атака. При ней сознание концентрируется на дыхании, частое дыхание дополняет желание звонить кому-то, спасаясь от страха погибнуть…
   Все компоненты тревоги (физические, эмоциональные, двигательные) влияют друг на друга, усиливая. Если из этой цепи убрать какой-то один «кирпичик», то вся «стена» рухнет. Если воздействовать на физические реакции стресса, то есть, на сами мышцы, появится возможность их расслабить   стресс и тревога пройдут или уменьшатся.
   Данный метод состоит из нескольких этапов:
   1 этап Задача: научить мышцы чувствовать разницу между напряжением и расслаблением. Если сильно напрячь мышцу, весь кортизол в ней пережжется, и после расслабления удастся почувствовать в ней покой и умиротворение.
   Каждый день, а лучше два раза в день, по 2-3 минуты, необходимо спокойно садиться или ложиться, и начинать последовательно напрягать отдельные группы мышц, считая до пяти. Следует сокращать мышцы, достигая 70-80% от максимального напряжения, а после расслаблять их. Так следует поочередно тренировать все группы мышц. После выполнения упражнения Вы сможете почувствовать расслабление. Оно   признак снижения или избавления от тревоги.
   2 этап. Научиться снимать напряжение и тревогу в повседневных жизненных ситуациях. После закрепления навыка расслабления-напряжения, необходимо напрячь все мышцы сразу, также считая до пяти. Напряжение сменить расслаблением, выполнив 5-6 раз данное упражнение.  После сжигания кортизола наступит чувство покоя.
   3 этап: Когда мышцы запомнят ощущения расслабления, разницу с ощущениями напряжения, необходимо перейти к фазе сознательного управления мышечным напряжением, подавая себе разные команды. По команде «Расслабься!» следует добиваться расслабления, добиваясь увеличения расслабления с каждым разом. По аналогии следует добиваться напряжения, учиться смене этих состояний по команде. 
   После успешных упражнений, можно переносить сформированные навыки в привычную жизнь. В ситуации предстоящей сложной встречи с нервным возбуждением, события, необходимо дать себе команду: «Расслабься» и расслабиться незаметно для других. Это удастся быстро сделать, если все предыдущие этапы выполнялись правильно и последовательно, что позволило сформировать устойчивый навык.
   Главное правило данной техники – это постепенное развитие способности напрягаться-расслабляться по команде, сначала, вовлекая отдельные группы мышц, а затем – весь организм. Стремление начать со сложного не позволит справиться с задачей, мозг не сможет управлять мышцами, а они не смогут понимать его команды (метод особенно эффективен для лиц, страдающих паническими атаками, тревожными расстройствами; его нужно применять на регулярной основе).
""";
      case 16: finalText = """   1.	Начните с самонаблюдения. Формируйте привычку наблюдать за собой. Отмечайте свои реакции в разных обстоятельствах. Проанализируйте, как Вы реагируете на сложные и непредвиденные ситуации; на неожиданные поступки окружающих; на нехватку и переизбыток информации; на необходимость «вынужденной» активности; на грустные (радостные) события, переживаемые совместно (в одиночку).
   2.	Настойчиво формируйте психологическую культуру: учитесь адекватно выражать свои эмоции и чувства. Анализируйте свои эмоции в различных ситуациях деятельности и общения. Учитесь управлять своими эмоциями в сложных для Вас ситуациях.
   3.	Осваивайте наиболее приемлемые для Вас (эффективные) методы и приемы самоактуализации.
   4.	Ищите и находите компромисс между стремлением к успеху и заботой о своем эмоциональном благополучии.
   5.	Овладевайте навыками управления своими эмоциями и учитесь брать под контроль свои желания, определяя приоритеты в делах и задачах, в соответствии с ситуацией и личными возможностями.
   6.	Учитесь снижать стрессовое воздействие обстоятельств. Намеренно уходите от ситуаций, стрессовую нагрузку которых выдержать не в силах. Учитесь управлять реакциями и поведением. Старайтесь контролировать эмоции и чувства. 
   7.	Обучайтесь приемам совладания со стрессом, осваивайте новые копинг-стратегии.
   8.	Контролируйте объем поступающей информации, учитывайте специфику ее источников. Отказывайтесь от ненужной и бесполезной информации. Учитывайте при анализе сведений их источник (соцсети, персональные сайты, сомнительные каналы.
   9.	Овладевайте техниками и приемами эффективной межличностной комммуникации. Благополучие социальных контактов больше, чем иные факторы обеспечивают устойчивость эмоционального состояния.
""";
      case 17: finalText = """   1.	Начните с самонаблюдения. Формируйте привычку наблюдать за собой. Отмечайте свои реакции в разных обстоятельствах, особенно отмечайте, как Вы реагируете на сложные ситуации, на факторы, возникшие непредвиденно, на неожиданные поступки людей, на нехватку информации и средств, на необходимость проявлять активность сверх меры, на грустные и радостные события, переживаемые вместе с кем-либо и в одиночку.
   2.	Настойчиво формируйте психологическую культуру в выражении эмоций и чувств, в поведении и в деятельности, в общении с другими людьми и самых разных ситуациях, особенно там, где Вам с трудом удается управлять собой, совладать со своими эмоциональными проявлениями. 
   3.	Осваивайте методы и приемы самоактуализации, определяя наиболее удачные направления самовыражения.
   4.	Ищите и находите компромисс между стремлением к успеху и заботой об эмоциональном благополучии.
   5.	Овладевайте навыками управления своими эмоциями и учитесь брать под контроль свои желания, определяя приоритеты в делах и задачах, в соответствии с ситуацией и личными возможностями.
   6.	Учитесь снижать стрессовое воздействие обстоятельств, намеренно уходя от ситуаций, стрессовую нагрузку которых выдержать не в силах, или управляя реакциями и поведенческими проявлениями, намеренно контролируя эмоции и чувства, активность.
   7.	Обучайтесь приемам совладания со стрессом, осваивайте новые копинг-стратегии.
   8.	Контролируйте объем поступающей информации, учитывайте специфику ее источников. Отказывайтесь от ненужной и бесполезной информации. Учитывайте при анализе сведений их источник (соцсети, персональные сайты, сомнительные каналы.
   9.	Овладевайте техниками и приемами эффективной межличностной комммуникации. Благополучие социальных контактов больше, чем иные факторы обеспечивают устойчивость эмоционального состояния.
""";
    }

    return finalText;
  }
}